# Estatística Aplicada à Computação/Telemática 
# Lista de Exercícios 10b

__Aluno:__ Guilherme Santos Silva

In [1]:
import pandas as pd
import numpy as np

# Atividade 2.1

In [2]:
df = {'Nome' : ['João da Silva', 'Pedro Fernandes', 'Maria Freitas', 'Paula Gonçalves', 'Ana Freitas', 'Luiz Costa', 'André Souza', 'Patrícia Silva', 'Regina Lima', 'Alfredo Souza',  'Margarete Cunha', 'Pedro Barbosa', 'Ricardo Alves', 'Márcio Rezende', 'Ana Carolina Chaves' ],
     'Idade' : ['36', '51', '26', '25', '29', '53', '42', '38', '35', '45', '26', '37', '24', '31', '29'],
     'Salário' : ['6300', '5700', '4500', '3800', '3200', '7300', '7100', '5600', '6400', '7000', '3700', '6500', '4000', '5100', '4500']}

In [3]:
tab = pd.DataFrame(df)
tab

                   Nome Idade Salário
0         João da Silva    36    6300
1       Pedro Fernandes    51    5700
2         Maria Freitas    26    4500
3       Paula Gonçalves    25    3800
4           Ana Freitas    29    3200
5            Luiz Costa    53    7300
6           André Souza    42    7100
7        Patrícia Silva    38    5600
8           Regina Lima    35    6400
9         Alfredo Souza    45    7000
10      Margarete Cunha    26    3700
11        Pedro Barbosa    37    6500
12        Ricardo Alves    24    4000
13       Márcio Rezende    31    5100
14  Ana Carolina Chaves    29    4500

__1. Na Tabela 2.2 temos as informações sobre idade e salário para os 15 funcionários do Departamento de Recursos Humanos. Construa uma tabela de frequências para a idade, levando em conta as mesmas faixas etárias utilizadas acima.__

In [4]:
#colocando as idades em ordem.
tab.sort_values('Idade')

                   Nome Idade Salário
12        Ricardo Alves    24    4000
3       Paula Gonçalves    25    3800
2         Maria Freitas    26    4500
10      Margarete Cunha    26    3700
4           Ana Freitas    29    3200
14  Ana Carolina Chaves    29    4500
13       Márcio Rezende    31    5100
8           Regina Lima    35    6400
0         João da Silva    36    6300
11        Pedro Barbosa    37    6500
7        Patrícia Silva    38    5600
6           André Souza    42    7100
9         Alfredo Souza    45    7000
1       Pedro Fernandes    51    5700
5            Luiz Costa    53    7300

In [5]:
tab['Idade'].value_counts(0)

29    2
26    2
38    1
51    1
36    1
24    1
42    1
31    1
37    1
35    1
45    1
53    1
25    1
Name: Idade, dtype: int64

# Atividade 2.2

__2. Construa uma distribuição de frequências agrupadas em 5 classes de mesmo comprimento para os dados de salários da Tabela 2.2.__

In [6]:
tab['Salário'].value_counts(0).head(5)

4500    2
6400    1
5600    1
6300    1
5100    1
Name: Salário, dtype: int64